NetologySlow/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

NetologySlow/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Цены
	Движения.Цены.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;

	Сообщить("Проведен " + Ссылка);

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный=ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры
